WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/kerneltests/power_management_tests.c
/****************************************************************************
 * configs\stm32f777zit6-meadow\src\kerneltests\power_management_tests.c
 * 
 *   Copyright (C) 2019 - 2021 Wilderness Labs. All rights reserved.
 *   Author:  Wilderness Labs
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "../hcom_nx/hcom_nx_common.h"

#if defined (CONFIG_MEADOW_PWR_MGMT_SUPPORT)

#include <meadow/hcom_shared_common.h>

#include <nuttx/arch.h>
#include <nuttx/mtd/mtd.h>
#include <sys/mount.h>
#include <dirent.h>
#include <sys/stat.h>
#include "stm32_rtc.h"
#include "stm32_exti.h"
#include "stm32_gpio.h"                 // Needed for testing input gpio->event
#include <arch/board/board.h>           // Needed for testing getreg16
#include "chip/stm32f76xx77xx_pwr.h"    // Needed for testing

/************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************/

/************************************************************************************
 * Private Data
 ************************************************************************************/
// static char *thisFile = __FILE__;

/************************************************************************************
 * Public Data
 ************************************************************************************/

/************************************************************************************
 * Private Function Prototypes
 ************************************************************************************/

// Needed for testing rtc alarm wakeup
static int pwmmgmt_test_timer_and_alarm_wakeup(time_t wakeupPeriod);

/************************************************************************************
 * Private Functions
 ************************************************************************************/
#if MEADOW_WHICH_WAKEUP_TIMING_METHOD == 'R'
// ISR called when the RTC generates an alarm. Willi ndicate time to exit
// low-power mode.
static int pwmmgmt_test_rtc_alarm_isr_handler(int irq, FAR void *context, FAR void *arg)
{
  // Clear the EXTI Pending Register for the RTC alarm event
  putreg32(EXTI_RTC_ALARM, STM32_EXTI_PR);

  syslog(2, "RTC Alarm A - Interrupt Service Routine called\n");

  // Only called once so no more interrupts expected, needed or wanted
  // Note: in the non-test code this isn't done in the ISR
  up_disable_irq(STM32_IRQ_RTCALRM);
  irq_detach(STM32_IRQ_RTCALRM);

  return OK;
}
#else
// ISR called when wakeup timer reaches 0 indicating time to exit-power mode.
static int pwmmgmt_test_wakeup_timer_isr_handler(int irq, FAR void *context, FAR void *arg)
{
  // Clear the EXTI Pending Register for the wakeup event
  putreg32(EXTI_RTC_WAKEUP, STM32_EXTI_PR);
  
  syslog(2, "RTC Wakeup Timer ISR called\n");

  up_disable_irq(STM32_IRQ_RTC_WKUP);
  irq_detach(STM32_IRQ_RTC_WKUP);

  return OK;
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/
// Called from nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/tests/hcom_nx_developer_3_tests.c
// These tests are for testing the power management implementation
int meadow_kt_power_management_tests(uint32_t userData)
{
  int ret = OK;

  switch(userData)
  {
    // case 51:
    //   // Enter Sleep mode very low savings, wakes right up.
    //   syslog(2, "==>>power mgmt tests received %u - Sleep mode\n", userData);
    //   sleep(1);
    //   ret = meadow_pwr_mgmt_enter_sleep();
    //   break;

    case 52:
      // Enter Stop mode with max power savings & slowest restart
      syslog(2, "==>>power mgmt tests received %u - Stop mode MAX savings\n", userData);
      sleep(1);
      // Directly execute stop mode with no timer setup
      ret = pwrmgmt_enter_stop_mode();
      break;

    case 53:
      // Enter Stop mode with minimum power savings & fastest restart
      syslog(2, "==>>power mgmt tests received %u - Stop mode Min savings\n", userData);
      sleep(1);
      // Directly execute stop mode with no timer setup
      ret = pwrmgmt_enter_stop_mode();
      break;

    // case 54:
    //   // Enter Standby mode. This is the lowest possible power mode
    //   syslog(2, "==>>power mgmt tests received %u - Standby mode\n", userData);
    //   usleep(100 * 1000);
    //   ret = meadow_pwr_mgmt_enter_standby();
    //   break;

    case 55:
      // Set clock to HSE
      syslog(2, "==>>power mgmt tests received %u - HSE for clock\n", userData);
      usleep(20 * 1000);
      ret = meadow_pwr_mgmt_use_hse_for_rtc();
      break;

    case 56:
      // Set clock to LSI
      syslog(2, "==>>power mgmt tests received %u - LSI for clock\n", userData);
      usleep(20 * 1000);
      // The following function calls will result in the the F7 being put into sleep mode for 45 seconds.
      ret = meadow_pwr_mgmt_use_lsi_for_rtc();
      break;

    case 57:
      // Set for wakeup after X seconds. After this period a call to an ISR and
      // is used that the wakeup timer is working  as expected. No switching
      // clocks or going to sleep.
      syslog(2, "==>>power mgmt tests received %u - Testing wakeup timer, not sleep\n", userData);
      usleep(20 * 1000);
      // Should call alarm ISR in x seconds
      ret = pwmmgmt_test_timer_and_alarm_wakeup(15);
      break;

    case 58:
      // Set alarm for X sec, switch to LSI, enter Stop-mode, after alarm wake up switch to HSE.
      syslog(2, "==>>power mgmt tests received %u - Sleeping for 10 seconds\n", userData);
      usleep(20 * 1000);

      // Wakeup after x seconds
      ret = pwrmgmt_enter_stm32f7_stop_mode(10);
      break;

    default:
    syslog(2, "Unknown value %u passed to hcom_nx_exec_power_mgmt_tests()\n", userData);
    break;
  }

  return ret;
}

//=========================================================
// Set alarm for X sec, switch to LSI, enter Stop-mode, after alarm
// wake up switch to HSE.
int pwmmgmt_test_timer_and_alarm_wakeup(time_t wakeupPeriod)
{
  int ret;

#if 1   // FOR TESTING THE TESTING CODE
  struct timespec abstime;
  struct tm tmNowNx;
  struct tm tmNowRtc;

  up_rtc_getdatetime(&tmNowRtc);            // RTC Hardware time
  clock_gettime(CLOCK_REALTIME, &abstime);  // Nuttx internal time
  gmtime_r(&abstime.tv_sec, &tmNowNx);

  syslog(2, "Before Stop - RTC-%4d-%02d-%02dT%02d:%02d:%02d, Nuttx-%4d-%02d-%02dT%02d:%02d:%02d\n",
            tmNowRtc.tm_year + 1900, tmNowRtc.tm_mon + 1, tmNowRtc.tm_mday,
            tmNowRtc.tm_hour, tmNowRtc.tm_min, tmNowRtc.tm_sec,
            tmNowNx.tm_year + 1900, tmNowNx.tm_mon + 1, tmNowNx.tm_mday,
            tmNowNx.tm_hour, tmNowNx.tm_min, tmNowNx.tm_sec);
#endif   // FOR TESTING ONLY

#if MEADOW_WHICH_WAKEUP_TIMING_METHOD == 'R'
  // Configure the hardware
  // Set alarm wakeup period and wait for ISR to notify that time has elasped
  syslog(2, "==> Setting RTC alarm for %d seconds\n", wakeupPeriod);
  ret = pwrmgmt_config_rtc_alarm_wakeup_seconds(wakeupPeriod);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Error:\n", __FILE__, __LINE__);
    return ret;
  }
#else
  // Set wakeup timer period and wait for ISR to notify time has elasped
  syslog(2, "==> Setting RTC wakeup timer for %d seconds\n", wakeupPeriod);
  ret = pwrmgmt_config_rtc_timer_wakeup_seconds(wakeupPeriod);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Error:\n", __FILE__, __LINE__);
    return ret;
  }
#endif
  // Prepare for wakeup by configuring an ISR to be called when the time 
  // period has been reached.
#if MEADOW_WHICH_WAKEUP_TIMING_METHOD == 'R'
  // For using RTC Alarm timing
  irq_attach(STM32_IRQ_RTCALRM, pwmmgmt_test_rtc_alarm_isr_handler, NULL);
  up_enable_irq(STM32_IRQ_RTCALRM);
#else
  // Setup the testing ISR for the RTC wakeup timer counting down to 0.
  irq_attach(STM32_IRQ_RTC_WKUP, pwmmgmt_test_wakeup_timer_isr_handler, NULL);
  up_enable_irq(STM32_IRQ_RTC_WKUP);
#endif

#if 1  // FOR TESTING. Use the HCOM thread to loop until it's time wakeup
  int countDown = wakeupPeriod;
  
  while(countDown > -2)
  {
    // Check ALRAF and EXTI_PR's EXTI_RTC_ALARM bit
    syslog(2, "==>%02d RTC Time:%08x, ALRAF:%d, EXTI PR:%d\n", countDown,
              getreg32(STM32_RTC_TR),
              getreg32(STM32_RTC_ISR) & RTC_ISR_ALRAF ? 1 : 0,
              getreg32(STM32_EXTI_PR) & EXTI_RTC_ALARM ? 1 : 0);
    sleep(1);
    countDown--;
  }

  syslog(1, "==>%d Final RTC Time:%08x\n", countDown, getreg32(STM32_RTC_TR));

#endif

  return OK;
}

#endif    // #if defined (CONFIG_MEADOW_PWR_MGMT_SUPPORT)
